// prisma/seed.ts
import "dotenv/config";
import { PrismaClient, StoreQuestionType, Prisma } from "../generated/prisma";
import { PrismaPg } from "@prisma/adapter-pg";

const connectionString = process.env.DATABASE_URL;
if (!connectionString) {
  throw new Error("DATABASE_URL environment variable is required for Prisma.");
}

const prisma = new PrismaClient({
  adapter: new PrismaPg({ connectionString }),
});

// ===============================
// Config default questions
// ===============================

const storeQuestionTemplates = [
  {
    key: "waste_types",
    label: "ขยะหรือของเสียของร้านมีอะไรบ้าง",
    description: "เลือกได้หลายข้อ",
    type: StoreQuestionType.MULTI_SELECT,
    order: 1,
    options: [
      { value: "food_waste", label: "เศษอาหาร" },
      { value: "plastic", label: "พลาสติก / ถุงพลาสติก" },
      { value: "oil", label: "น้ำมันใช้แล้ว" },
      { value: "waste_water", label: "น้ำเสียจากการล้างจาน/เตรียมอาหาร" },
      { value: "packaging", label: "บรรจุภัณฑ์ใช้แล้ว (แก้ว/กล่อง)" },
      { value: "other", label: "อื่น ๆ" },
    ],
  },
  {
    key: "waste_management",
    label: "แนวทางการจัดการขยะหรือของเสียข้างต้น",
    description: "อธิบายวิธีจัดการขยะ ของเสีย และการแยก/กำจัด",
    type: StoreQuestionType.TEXT,
    order: 2,
    options: undefined,
  },
  {
    key: "equipment",
    label: "อุปกรณ์ไฟฟ้าและอุปกรณ์ในครัวที่คาดว่าจะใช้",
    description: "เลือกอุปกรณ์หลักที่ใช้ประจำ เลือกได้หลายข้อ",
    type: StoreQuestionType.MULTI_SELECT,
    order: 3,
    options: [
      { value: "electric_stove", label: "เตาไฟฟ้า" },
      { value: "gas_stove", label: "เตาแก๊ส" },
      { value: "induction_stove", label: "เตาแม่เหล็กไฟฟ้า" },
      { value: "rice_cooker", label: "หม้อหุงข้าว" },
      { value: "fridge", label: "ตู้เย็น / ตู้แช่" },
      { value: "microwave", label: "เตาไมโครเวฟ" },
      { value: "blender", label: "เครื่องปั่น" },
      { value: "other", label: "อื่น ๆ" },
    ],
  },
] as const;

export const consentText: Prisma.ConsentTextCreateManyInput[] = [
  {
    version: 1,
    title: 'ข้อตกลงในการดำเนินการขอสิทธิ์และการออกร้านค้านิสิต งานเกษตรแฟร์ ประจำปี 2569 มหาวิทยาลัยเกษตรศาสตร์ บางเขน',
    content: 
`1. ผู้ได้รับสิทธิ์จะต้องเป็นนิสิตที่กำลังศึกษาอยู่ในระดับปริญญาตรี ของมหาวิทยาลัยเกษตรศาสตร์ บางเขน และจะต้องไม่โอนกรรมสิทธิ์ในการใช้พื้นที่ให้แก่บุคคลอื่น ไม่ว่าจะเป็นนิสิตมหาวิทยาลัยเกษตรศาสตร์หรือบุคคลภายนอก  หากกองพัฒนานิสิตหรือคณะกรรมการจากทางมหาวิทยาลัย ตรวจสอบพบว่าผู้ที่ออกร้านค้าในงานเกษตรแฟร์นั้น มิใช่ผู้ได้สิทธิ์ จะถูกระงับสิทธิ์ในการจัดกิจกรรมการออกร้านค้างานเกษตรแฟร์ทันที และถูกดำเนินการตามขั้นตอนการสอบสวนวินัยนิสิต
2. ผู้ได้รับสิทธิ์จะต้องอยู่ภายในบริเวณร้านค้าตลอดงานเกษตรแฟร์ เพื่อยืนยันว่าไม่ได้มีการโอนกรรมสิทธิ์ให้แก่ผู้อื่น และจะต้องเปิดร้านค้าตามวันและเวลาที่มหาวิทยาลัยกำหนด เพื่อบรรยากาศภาพรวมของงานเป็นไปด้วยความเรียบร้อย
3. สินค้าที่นำมาจำหน่ายต้องเป็นผลงานที่นิสิตผู้ได้รับสิทธิ์ ผลิต คิดสร้างสรรค์ หรือมีส่วนร่วมในการออกแบบและพัฒนาเอง โดยห้ามนำสินค้าสำเร็จรูปหรือสินค้าจากแบรนด์ที่มีจำหน่ายทั่วไปมาจำหน่ายในนามร้านค้านิสิต และสินค้าต้องมีความเหมาะสม ไม่ขัดต่อกฎหมาย ศีลธรรม หรือระเบียบของมหาวิทยาลัย
4. ผู้ได้รับสิทธิ์จะต้องดำเนินกิจกรรมภายในพื้นที่ที่กำหนดให้เท่านั้น ห้ามล้ำออกจากพื้นที่ที่กำหนด หรือกีดขวางเส้นทางการจราจร หรือห้ามเคลื่อนย้ายเต็นท์หรือแสลน ห้ามกางร่มหรือต่อเติมอุปกรณ์ใด ๆ ทั้งสิ้น
5. ในกรณีที่เกิดความเสียหายอันเนื่องมาจากการกระทำของผู้ได้รับสิทธิ์ในการออกร้านค้า ไม่ว่าจะโดยเจตนาหรือประมาทเลินเล่อก็ตาม มหาวิทยาลัยจะไม่รับผิดชอบต่อความเสียหายที่เกิดขึ้นนั้น และมหาวิทยาลัยมีสิทธิ์ในการเรียกร้องค่าปรับ ค่าเสียหายตามการประเมินมูลค่าความเสียหายที่เกิดขึ้นกับผู้ได้รับสิทธิ์ในการออกร้านค้าอีกด้วย
6. ห้ามกระทำการใด ๆ อันก่อให้เกิดการเปลี่ยนแปลงต่อลักษณะทางกายภาพเดิมของสถานที่ เช่น ตัดแต่งต้นไม้ ทาสีพื้นถนน เคลื่อนย้ายตัวหนอน หรือติดตั้งอุปกรณ์อื่นเพิ่มเติม เป็นต้น หากมีการละเมิด มหาวิทยาลัยมีสิทธิ์เรียกร้องค่าปรับ ค่าเสียหายตามการประเมินมูลค่าความเสียหายที่เกิดขึ้นกับผู้ได้รับสิทธิ์ในการออกร้านค้า
7. ห้ามกระทำการใด ๆ อันเป็นการละเมิดต่อกฎหมาย และก่อความไม่สงบเรียบร้อยในระหว่างการจัดงานเกษตรแฟร์ อาทิ
ห้ามดื่ม หรือใช้ จำหน่าย จ่าย แจก เครื่องดื่มที่มีส่วนผสมของแอลกอฮอล์และสารเสพติดทุกชนิด หากฝ่าฝืนจะถูกยึดสารเสพติดดังกล่าว พร้อมทั้งยึดเงินประกันความเสียหายทั้งหมด และตัดสิทธิ์ให้ออกจากพื้นที่จัดกิจกรรมทันที ถูกดำเนินคดีตามกฎหมาย รวมถึงได้รับโทษตามข้อบังคับมหาวิทยาลัยเกษตรศาสตร์
	- ห้ามเล่น และ/หรือ จำหน่ายพลุ ประทัด ดอกไม้ไฟ หรือวัตถุอันก่อให้เกิดเสียงดังหรือประกายไฟ
	- ห้ามเล่นหรือจัดให้มีการเล่นการพนัน เสี่ยงโชคทุกชนิด
	- ห้ามก่อเหตุทะเลาะวิวาท การประพฤติปฏิบัติในเชิงชู้สาวที่ไม่เหมาะสม หรือกระทำการอันละเมิดต่อสิทธิส่วนบุคคลหรือชื่อเสียงของมหาวิทยาลัยเกษตรศาสตร์
	- ห้ามใช้เครื่องใช้ไฟฟ้าที่มีกำลังเกินกว่า 3,000 วัตต์ ทั้งนี้เพื่อป้องกันปัญหาไฟฟ้าตกหรือดับในขณะจัดกิจกรรม
	- ห้ามก่อให้เกิดเสียงดัง ใช้เครื่องกระจายเสียง อันเป็นการรบกวนผู้อื่น หรือร้านค้าที่อยู่ใกล้เคียง
	- ต้องรักษาความสะอาดร้านค้า และบริเวณโดยรอบในพื้นที่ของตนเองให้สะอาดเรียบร้อย ไม่ทิ้งเศษอาหาร รวมทั้งกำจัดสิ่งปฏิกูลที่อาจก่อให้เกิดกลิ่นไม่พึงประสงค์หลังจากเลิกงานในแต่ละวันด้วย
	- หากผู้ได้สิทธิ์กระทำการอื่นใดนอกจากที่ระบุไว้ อันก่อให้เกิดความไม่สงบเรียบร้อยในระหว่างการขอสิทธิ์และในช่วงเวลาของการจัดงาน หรือขัดขวางการดำเนินงานของมหาวิทยาลัย จะถูกดำเนินการตามระเบียบวินัยนิสิต
8. ในระหว่างการแสดงสินค้าถ้าเกิดภัยพิบัติ อัคคีภัย หรือถูกทำลาย สูญหาย ด้วยประการใด ๆ อันเป็นเหตุให้เกิดความเสียหายต่อชีวิต ร่างกายและทรัพย์สิน หากซึ่งความเสียหายที่เกิดขึ้น มิใช่ความผิดของมหาวิทยาลัย ผู้ได้รับสิทธิ์ในพื้นที่ไม่สามารถเรียกร้องค่าเสียหายใด ๆ ที่เกิดจากเหตุดังกล่าวจากมหาวิทยาลัยได้ทั้งสิ้น
9. ผู้ได้รับสิทธิ์จะต้องทำแบบประเมินและส่งสรุปผลการดำเนินงาน ตามที่กองพัฒนานิสิตกำหนด
10. มหาวิทยาลัยขอสงวนสิทธิ์ในการเปลี่ยนแปลงเงื่อนไขข้อตกลงในกรณีที่มีเหตุอันสมควร โดยมิต้องแจ้งให้นิสิตผู้ได้รับสิทธิ์ทราบล่วงหน้าก็ได้ การพิจารณาของมหาวิทยาลัยเกษตรศาสตร์ ถือเป็นที่สุด
11. ระหว่างการแสดงสินค้าในงานวันเกษตรแฟร์ ผู้ได้รับสิทธิ์ต้องปฏิบัติตามนโยบาย ระเบียบ ข้อบังคับ แนวทาง หรือคำสั่งอื่นใดของมหาวิทยาลัยเกษตรศาสตร์
12. หากผู้ได้รับสิทธิ์ละเมิดข้อตกลงดังกล่าวไม่ว่าข้อใดข้อหนึ่ง  และมหาวิทยาลัยเกษตรศาสตร์ ตรวจสอบพบว่ามีการกระทำอันละเมิดดังกล่าวเป็นข้อเท็จจริงที่เกิดขึ้น มหาวิทยาลัยมีสิทธิ์ระงับการออกร้านค้างานเกษตรแฟร์ได้ทันที และถูกดำเนินการตามระเบียบวินัยนิสิต`,
    language: 'th',
    active: true,
  },
] as const;

async function main() {
  console.log("Seeding store question templates...");

  for (const tpl of storeQuestionTemplates) {
    await prisma.storeQuestionTemplate.upsert({
      where: { key: tpl.key },
      create: {
        key: tpl.key,
        label: tpl.label,
        description: tpl.description ?? null,
        type: tpl.type,
        order: tpl.order ?? null,
        isActive: true,
        // options เป็น JSON → Prisma รับ object/array ได้ตรง ๆ
        options: tpl.options as any,
      },
      update: {
        label: tpl.label,
        description: tpl.description ?? null,
        type: tpl.type,
        order: tpl.order ?? null,
        isActive: true,
        options: tpl.options as any,
      },
    });
  }
  console.log("✅ Seeded store question templates successfully");

  for (const consent of consentText) {
    await prisma.consentText.createMany({
        data: consent,
        skipDuplicates: true,
      });
  }
  console.log("✅ Seeded store consent text successfully");

}

main()
  .catch((e) => {
    console.error("❌ Seed failed:", e);
    process.exit(1);
  })
  .finally(async () => {
    await prisma.$disconnect();
  });
